from modules.tasks_functions import *

# === 1. Побудувати трикутну і трапецієподібну ФП ===
task1()

# === 2. Побудувати просту і двосторонню ФП Гауса, утворену за допомогою різних функцій розподілу ===
task2()

# === 3. Побудувати ФП "узагальнений дзвін", яка дозволяє представляти нечіткі суб'єктивні переваги. ===
task3()

# === 4. Побудувати набір сигмоїдних ФП: основну односторонню; додаткову двосторонню; додаткову несиметричну ===
task4()

# === 5. Побудувати набір поліноміальних функцій приналежності (Z-, PI- і S-функцій). ===
task5()

# === 6. Побудувати мінімаксну інтерпретацію логічних операторів з використанням операцій мінімуму і максимуму ===
task6()

# === 7. Побудувати вірогідну інтерпретацію кон’юнктивних і диз’юнктивних операторів ===
task7()

# === 8. Побудувати доповнення нечіткої множини ===
task8()
